app/views/users/show.html.erb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Merlin"], ["last_name", "Sawayn"], ["email", "juliusjohns@mcclure.net"], ["created_at", "2022-08-29 10:55:12.626562"], ["updated_at", "2022-08-29 10:55:12.626562"]]
---
        <td><%= @user.email %></td>
        <td><%= @user.created_at.strftime("%d %b %Y %H:%M") %></td>