app/controllers/users_controller.rb

  def index
    status = params[:status]
    if status.present?
      @users = User.where(status: status).order(:id).page params[:page]
    else
      @users = User.order(:id).page params[:page]
---
SELECT "users".* FROM "users" WHERE "users"."status" = $1 ORDER BY "users"."id" ASC LIMIT $2 OFFSET $3  [["status", "Active"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "users" WHERE "users"."status" = $1 ORDER BY "users"."id" ASC LIMIT $2 OFFSET $3) subquery_for_count  [["status", "Inactive"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 5], ["OFFSET", 0]]

  def delete_data
    User.destroy_all
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 213]]

  def populate_data
    #Workers::UsersWorker.perform_async()
    users = Api::FetchUsers.new.call
    users.each {  |user| persist(user) unless User.find_by(email: user["email"]).present? }
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "juliusjohns@mcclure.net"], ["LIMIT", 1]]

  def persist(user)
    User.create(
      user_id:    user["id"].to_s,
      first_name: user["first_name"],
      last_name:  user["last_name"],
      status:     user["status"],
      email:      user["email"]
      )
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Merlin"], ["last_name", "Sawayn"], ["email", "juliusjohns@mcclure.net"], ["created_at", "2022-08-29 19:39:57.639922"], ["updated_at", "2022-08-29 19:39:57.639922"]]